Revit 2027 API
DirectShape.AppendShape(ShapeBuilder) Method
 Appends shape built by the supplied ShapeBuilderObject to shape representation stored in this DirectShape. The data stored in the supplied ShapeBuilder object will be cleared.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AppendShape(
	ShapeBuilder ShapeBuilder
)
Public Sub AppendShape (
	ShapeBuilder As ShapeBuilder
)
public:
void AppendShape(
	ShapeBuilder^ ShapeBuilder
)
member AppendShape :
        ShapeBuilder : ShapeBuilder -> unit
Parameters
ShapeBuilder ShapeBuilder
 The ShapeBuilder object that was used to build the shape to be appended.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The existing shape will not be cleared by this function, and intersecting or overlapped geometry will not be joined with the appended geometry. It is up to the caller to ensure that the combination of geometry will have the correct appearance in Revit. This function will bypass extra geometry validation because the built geometry has already been validated by the ShapeBuilder. It is therefore slightly more efficient than the AppendShape() routine that accepts GeometryObjects directly as input.
See Also
Reference
DirectShape Class
AppendShape Overload
Autodesk.Revit.DB Namespace